record_app_api/app/controllers/records_controller.rb

SELECT "records".* FROM "records"
---
  def index
    @records = Record.all

INSERT INTO "records" ("artist", "title", "year", "label", "format", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["artist", "x"], ["title", "x"], ["year", 0], ["label", "x"], ["format", "z"], ["created_at", "2020-02-07 17:57:33.044277"], ["updated_at", "2020-02-07 17:57:33.044277"]]
---
  def create
    @record = Record.new(record_params)

    if @record.save

UPDATE "records" SET "title" = $1, "updated_at" = $2 WHERE "records"."id" = $3  [["title", "S/T"], ["updated_at", "2020-02-06 19:07:35.810928"], ["id", 45]]
---
  def update
    if @record.update(record_params)

DELETE FROM "records" WHERE "records"."id" = $1  [["id", 220]]
---
  def destroy
    @record.destroy

SELECT "records".* FROM "records" WHERE "records"."id" = $1 LIMIT $2  [["id", 45], ["LIMIT", 1]]
---
    def set_record
      @record = Record.find(params[:id])